---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArray.ForwardIterator
source: html/17d7c835-69f1-8fa2-9eed-1b521cbd0ebc.htm
---
# Autodesk.Revit.DB.IntersectionResultArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IntersectionResultArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.